
Функция Детерминант(МассивМатрицы, Размер) Экспорт

    Определитель = 0;

    Если Размер = 1 Тогда 
    
		Определитель = МассивМатрицы[0][0];
			
    ИначеЕсли Размер = 2 Тогда 

		Определитель = МассивМатрицы[0][0] * МассивМатрицы[1][1] - МассивМатрицы[0][1] * МассивМатрицы[1][0];
    
	Иначе
		
        Матрица = Новый Массив(Размер - 1);
		
		Для i = 0 По Размер - 1 Цикл 
			
			Для j = 0 По Размер - 2 Цикл
               
				Если j < i Тогда  
					Матрица[j] = МассивМатрицы[j];
				Иначе
					Матрица[j] = МассивМатрицы[j + 1];
				КонецЕсли;
				
			КонецЦикла;
						
            Определитель = Определитель + Pow(-1, i + j) * Детерминант(Матрица, Размер - 1) * МассивМатрицы[i][Размер - 1];
			
		КонецЦикла;
	    
	КонецЕсли;		
		
	Возврат Определитель;

КонецФункции
